simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Excursion medida del tap de la etapa 0, en uV: 1114,4 - 759,4 mV. */
#ifndef CAL_STAGE0_EXCURSION_UV
#define CAL_STAGE0_EXCURSION_UV 355000L
#endif
/* Pendiente del IDAC de la etapa 0 sobre su tap a PGA x1, en uV por codigo. */
#ifndef CAL_STAGE0_UV_POR_CODIGO_X1
#define CAL_STAGE0_UV_POR_CODIGO_X1 62L
#endif

static int16 cal_stage0_max_change(void)
{
    int32 pga_x1000 = (int32)psoc_hw_pga_gain_x1000();
    int32 utiles;

    if (pga_x1000 <= 0L) {
        return (int16)PSOC_IDAC_SIGNED_MAX;
    }
    /* (excursion / 2) / (uV_por_codigo * ganancia), con el 20 % de margen.
     * Todo en int64 para que no desborde con ganancias chicas. */
    utiles = (int32)(((int64)CAL_STAGE0_EXCURSION_UV * 1000LL * 4LL) /
                     ((int64)CAL_STAGE0_UV_POR_CODIGO_X1 * (int64)pga_x1000 * 2LL * 5LL));
    if (utiles > (int32)PSOC_IDAC_SIGNED_MAX) {
        utiles = (int32)PSOC_IDAC_SIGNED_MAX;
    }
    /* Nunca menos de 24 codigos: por debajo de eso la etapa no podria corregir
     * ni su propio offset y el lazo abortaria por una cota que puso el firmware,
     * que es peor que abortar por el hardware. A x50 la cuenta da 105, asi que
     * este piso no se activa en ningun caso real; esta como red. */
    if (utiles < 24L) {
        utiles = 24L;
    }
    return (int16)utiles;
}

/* Cuanto puede moverse esta etapa respecto de su centro. Para la etapa 0 sale
 * de la cuenta de arriba; para las demas, de su tabla. */
static int16 cal_stage_max_change(const PsocCalStage *stage)
{
    if (stage->adc_channel == 0u) {
        int16 medido = cal_stage0_max_change();
        return (medido < stage->dac_max_change) ? medido : stage->dac_max_change;
    }
    return stage->dac_max_change;
}

static int16 cal_stage_min_dac(const PsocCalStage *stage)
{
    int32 lo = (int32)stage->dac_center - (int32)stage->dac_max_change;

    if (lo < -(int32)PSOC_IDAC_SIGNED_MAX) {
        lo = -(int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)lo;
}

static int16 cal_stage_max_dac(const PsocCalStage *stage)
{
    int32 hi = (int32)stage->dac_center + (int32)cal_stage_max_change(stage);

    if (hi > (int32)PSOC_IDAC_SIGNED_MAX) {
        hi = (int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)hi;
}

static int16 cal_stage_clamp_dac(const PsocCalStage *stage, int16 dac)
{
    int16 lo = cal_stage_min_dac(stage);
    int16 hi = cal_stage_max_dac(stage);

    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static int16 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global expresado como ticks legacy de 10 ms para mantener la escala
 * de configuracion anterior; en runtime lo ejecuta Timer_3 como one-shot. */
#ifndef CAL_WATCHDOG_TICKS
#define CAL_WATCHDOG_TICKS 40000UL
#endif

/* Periodo de telemetria de progreso (ticks legacy de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL
#define CAL_LEGACY_TICK_MS 10UL
#define CAL_WATCHDOG_MS (CAL_WATCHDOG_TICKS * CAL_LEGACY_TICK_MS)
#define CAL_PROGRESS_PERIOD_MS (CAL_PROGRESS_PERIOD_TICKS * CAL_LEGACY_TICK_MS)

/* Muestras del PI que se envian al ESP durante calibracion. No puede ser cada
 * muestra a 3 kHz: cada valor int32 viaja como 4 eventos UART. */
#ifndef CAL_PI_TELEM_PERIOD
#define CAL_PI_TELEM_PERIOD 256u
#endif

#ifndef CAL_PI_HAMMER_PASS_COUNT
#define CAL_PI_HAMMER_PASS_COUNT 1u
#endif

#if PSOC_HW_CLASS == PSOC_HW_HAMMER
#define CAL_PI_PASS_COUNT CAL_PI_HAMMER_PASS_COUNT
#else
#define CAL_PI_PASS_COUNT 1u
#endif

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 0u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

typedef struct {
    PsocCalAsyncState state;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 pass_index;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };




/* Primera etapa desde `desde` que efectivamente se calibra, o PSOC_CAL_STAGE_COUNT
 * si no queda ninguna. Las que estan fuera de la secuencia existen para el
 * instrumento -que necesita escribir sus IDAC- pero el lazo no las recorre. */
static uint8 cal_siguiente_etapa(uint8 desde)
{
    uint8 i;

    for (i = desde; i < PSOC_CAL_STAGE_COUNT; i++) {
        if (g_psoc_cal_stages[i].en_secuencia) {
            return i;
        }
    }
    return PSOC_CAL_STAGE_COUNT;
}

static int16 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

static void cal_stage_write_result(uint8 stage_index, int16 dac)
{
    if (stage_index < PSOC_CAL_STAGE_COUNT) {
        int16 clamped = cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index], dac);
        g_psoc_cal_stages[stage_index].write(clamped);
        g_psoc_cal_results[stage_index].final_dac = clamped;
        if (g_psoc_cal_result_count < PSOC_CAL_STAGE_COUNT) {
            g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
        }
    }
}

uint8 psoc_calibration_stage_count(void)
{
    return PSOC_CAL_STAGE_COUNT;
}

void psoc_calibration_seed_dac(const int16 *dac_values, uint8 count)
{
    uint8 i;

    for (i = 0u; i < count && i < PSOC_CAL_STAGE_COUNT; i++) {
        cal_stage_write_result(i, dac_values[i]);
    }
}

uint8 psoc_calibration_set_stage_dac(uint8 stage_index, int16 dac)
{
    if (stage_index >= PSOC_CAL_STAGE_COUNT) {
        return 0u;
    }

    cal_stage_write_result(stage_index, dac);
    /* El valor medido anterior ya no describe el codigo que acaba de
     * aplicarse. No permitir que un ajuste manual parezca calibrado. */
    g_psoc_cal_results[stage_index].final_measured = 0L;
    g_psoc_cal_results[stage_index].ok = 0u;
    return 1u;
}

