simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Ganancia fisica de la etapa, referencia -> tap, x1000.
 *
 * La etapa 0 es la unica que NO tiene ganancia fija: su tap es la salida del
 * PGA de entrada, asi que lo que la referencia mueve alla escala con la
 * ganancia que tenga puesto el PGA. Medido en la placa: 57,7 / 108,7 / 220,2 /
 * 448,7 uV por codigo para 1x / 2x / 4x / 8x, o sea proporcional. Sin esto el
 * PI usaba la ganancia de 1x para todas y a 8x pedia un esfuerzo ocho veces
 * mayor que el necesario.
 *
 * Que la etapa 0 tenga la ganancia mas chica es justamente lo que la hace
 * calibrable con precision: 57,7 uV por codigo es el paso mas fino de las
 * cuatro etapas. */
/* --------------------------------------------------------------------------
 * TAU DE LA PLANTA EN TIEMPO DE EJECUCION
 *
 * Estos dos son variables y no constantes por una razon medida, no por gusto:
 * tau depende de la temperatura -C1 es un electrolitico- y en la ubicacion del
 * nodo la temperatura va de 8 a 32 C en la misma semana. Una constante de banco
 * tomada a 19 C no cubre eso.
 *
 * La decision de Elias fue NO corregir por temperatura sino MEDIR tau en el
 * propio nodo y dimensionar la espera con lo medido. Estas variables son el
 * lugar donde aterriza esa medicion.
 *
 * Son uint16 por pedido explicito, y por eso tau esta en ms y no en muestras.
 * -------------------------------------------------------------------------- */
static uint16 g_cal_tau_ms          = CAL_PI_TAU_MS;
static uint16 g_cal_plant_tau_x10   = CAL_PI_PLANT_SETTLE_TAU_X10;

/* POR QUE NO HAY UNA ESPERA POR ETAPA. Habia un campo plant_settle_samples por
 * etapa, y sobra: la matriz de acople del 2026-09-04 midio tau en los SEIS
 * pares (etapa, tap) con senal util y dio 26,4 a 33,4 s, media 29,5. Es UN SOLO
 * polo -C1 contra R4- visto desde distintos lugares, no uno por etapa. Cuatro
 * constantes para un solo polo son cuatro oportunidades de que se
 * desincronicen. */
uint32 psoc_cal_plant_settle_samples(void)
{
    uint32 tau_muestras = CAL_PI_TAU_SAMPLES_FROM_MS(g_cal_tau_ms);
    /* Dividir antes de multiplicar: asi sigue entrando en uint32 aunque alguien
     * pida 10 tau. */
    return (tau_muestras / 10UL) * (uint32)g_cal_plant_tau_x10;
}

uint16 psoc_cal_get_tau_ms(void)
{
    return g_cal_tau_ms;
}

/* Devuelve 0 si el valor pedido es absurdo, para que un tau mal medido no pueda
 * dejar la calibracion esperando un tiempo ridiculo. Los limites son anchos a
 * proposito: 1 s a 60 s cubre el rango de temperatura de campo con margen
 * grande, y lo que se quiere atajar es un error de medicion, no afinar. */
uint8 psoc_cal_set_tau_ms(uint16 tau_ms)
{
    if (tau_ms < 1000u || tau_ms > 60000u) {
        return 0u;
    }
    g_cal_tau_ms = tau_ms;
    return 1u;
}

uint16 psoc_cal_get_plant_tau_x10(void)
{
    return g_cal_plant_tau_x10;
}

/* 0 = sin espera de planta (comportamiento viejo, util para comparar).
 * El techo de 100 son 10 tau, muy por encima de los 2 tau que fijo Elias. */
uint8 psoc_cal_set_plant_tau_x10(uint16 x10)
{
    if (x10 > 100u) {
        return 0u;
    }
    g_cal_plant_tau_x10 = x10;
    return 1u;
}

static int32 cal_pi_stage_gain_x1000(uint8 stage_index)
{
    int32 configured_gain = g_cal_pi_cfg[stage_index].gain_x1000;

    if (stage_index == 0u && configured_gain > 0L) {
        int32 pga_gain_x1000 = (int32)psoc_hw_pga_gain_x1000();
        if (pga_gain_x1000 > 0L) {
            return cal_round_div_i64((int64)configured_gain * (int64)pga_gain_x1000,
                                     1000LL);
        }
    }
    return configured_gain;
}

static int32 cal_pi_deadband_counts(uint8 stage_index)
{
#ifdef CAL_PI_FORCE_MIN_DEADBAND
    (void)stage_index;
    return CAL_PI_DEADBAND_MIN_COUNTS;
#else
    int32 deadband = g_cal_pi_cfg[stage_index].deadband_counts;

#if PSOC_HW_CLASS == PSOC_HW_GEO
    if (stage_index == 0u) {
        uint16 gain_x1000 = psoc_hw_pga_gain_x1000();
        if (gain_x1000 >= 6000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_8X_COUNTS;
        } else if (gain_x1000 >= 3000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_4X_COUNTS;
        } else if (gain_x1000 >= 1500u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_2X_COUNTS;
        } else {
            deadband = CAL_PI_DEADBAND_GEO_PGA_1X_COUNTS;
        }
    }
#endif
    if (deadband < CAL_PI_DEADBAND_MIN_COUNTS) {
        deadband = CAL_PI_DEADBAND_MIN_COUNTS;
    }
    return deadband;
#endif
}

static int32 cal_pi_error_bucket(int32 error_counts, int32 deadband_counts)
{
    int32 abs_error;
    int32 span;
    int32 bucket;

    span = (deadband_counts <= 0L) ? 1L : deadband_counts;
    abs_error = abs_counts(error_counts);
    if (abs_error <= span) {
        return 0L;
    }
    bucket = 1L + ((abs_error - span - 1L) / span);
    return (error_counts < 0L) ? -bucket : bucket;
}

static uint8 cal_pi_measurement_valid(int32 measured)
{
    return (measured >= CAL_ADC_SIGNED_MIN_COUNTS &&
            measured <= CAL_ADC_SIGNED_MAX_COUNTS) ? 1u : 0u;
}

static uint8 cal_stage_measure_current(uint8 stage_index, int16 dac, int32 *measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    ADC_Stop();
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();
    stage->write(dac);
    CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
    if (measured != (int32 *)0) {
        *measured = cal_adc_read_direct_counts();
    }
    return 1u;
}

static uint8 cal_stage_value_in_tolerance(uint8 stage_index, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    int32 control_sample = cal_pi_compare_counts(measured);
    int32 error_counts = stage->target_counts - control_sample;
    int32 deadband_counts = cal_pi_deadband_counts(stage_index);

    return (abs_counts(error_counts) <= deadband_counts &&
            cal_pi_measurement_valid(measured)) ? 1u : 0u;
}

static uint8 cal_verify_seeded_values(void)
{
    uint8 i;
    uint8 all_ok = 1u;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        PsocCalResult *result = &g_psoc_cal_results[i];
        int16 dac = cal_stage_current_dac(i);
        int32 measured = 0L;
        uint8 ok;

        /* Sin este salto el precheck nunca daria por buena la cadena: juzgaria
         * al PGA contra su objetivo nominal, que a x50 no se cumple ni se
         * pretende cumplir, y obligaria a recalibrar siempre. */
        if (!stage->en_secuencia) {
            result->final_dac = dac;
            result->final_measured = 0L;
            result->ok = 1u;
            continue;
        }

        cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);

        (void)cal_stage_measure_current(i, dac, &measured);
        ok = cal_stage_value_in_tolerance(i, measured);

