simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
        result->final_dac = dac;
        result->final_measured = measured;
        result->ok = ok;

        cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
        cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

        if (!ok) {
            all_ok = 0u;
        }
    }

    psoc_calibration_restore_capture_path();
    return all_ok;
}

static int32 cal_pi_abs_error_counts(const PsocCalStage *stage, int32 measured)
{
    int32 control_sample = cal_pi_compare_counts(measured);
    return abs_counts(stage->target_counts - control_sample);
}

static int32 cal_pi_gain_scaled_term(int32 value, int32 num, int32 div, int32 gain_x1000)
{
    int32 sign = 1L;

    if (div == 0L) {
        div = 1L;
    }
    if (gain_x1000 < 0L) {
        sign = -1L;
        gain_x1000 = -gain_x1000;
    }
    if (gain_x1000 == 0L) {
        gain_x1000 = 1000L;
    }
    /* value permanece en counts hasta esta division. La version anterior lo
     * redondeaba primero a un codigo IDAC entero y recien despues dividia por
     * la ganancia: en GEO_PGA eso descartaba correcciones reales de varios
     * LSB del actuador. Esta expresion encadena counts->uV->IDAC->etapa en un
     * unico cociente int64 y conserva toda la resolucion. */
    return sign * cal_round_div_i64(
        (int64)value * (int64)num * (int64)CAL_ADC_SPAN_UV * 1000LL,
        (int64)div * (int64)CAL_ADC_LEVELS *
        (int64)CAL_IDAC_UV_PER_LSB * (int64)gain_x1000);
}

#if PSOC_HW_CLASS == PSOC_HW_GEO
/* Transferencia firmada Vref_LP -> tap, medida en la placa el 2026-09-03.
 * Los valores son delta-counts respecto del codigo cero. Se usa solamente la
 * pendiente de cuerda entre el seed y el esfuerzo candidato: el PI sigue
 * cerrando el lazo con la medida, pero deja de suponer que la ganancia es
 * constante cuando en la mitad negativa cambia por un factor 2,6. */
static const int16 g_cal_geo_lp_codes[] = {
    -255, -224, -192, -160, -128, -96, -64, 0,
      32,   64,   96,  128,  160, 192, 224, 255
};
static const int16 g_cal_geo_lp_delta_counts[] = {
    -13367, -12582, -10319, -7995, -5761, -3649, -1870, 0,
       930,   1813,   2706,  3578,  4424,  5279,  6132, 6367
};
#define CAL_GEO_LP_CURVE_POINTS \
    ((uint8)(sizeof(g_cal_geo_lp_codes) / sizeof(g_cal_geo_lp_codes[0])))

static int32 cal_pi_geo_lp_response_counts(int16 code)
{
    uint8 i;

    if (code <= g_cal_geo_lp_codes[0]) {
        return (int32)g_cal_geo_lp_delta_counts[0];
    }
    for (i = 1u; i < CAL_GEO_LP_CURVE_POINTS; i++) {
        int16 x1 = g_cal_geo_lp_codes[i];
        if (code <= x1) {
            int16 x0 = g_cal_geo_lp_codes[i - 1u];
            int32 y0 = (int32)g_cal_geo_lp_delta_counts[i - 1u];
            int32 y1 = (int32)g_cal_geo_lp_delta_counts[i];
            return y0 + cal_round_div_i64((int64)(code - x0) * (int64)(y1 - y0),
                                          (int64)(x1 - x0));
        }
    }
    return (int32)g_cal_geo_lp_delta_counts[CAL_GEO_LP_CURVE_POINTS - 1u];
}

static int32 cal_pi_geo_lp_chord_gain_x1000(int16 base_dac, int16 target_dac)
{
    int32 delta_counts;
    int32 delta_code;
    int32 gain;

    if (target_dac == base_dac) {
        if (target_dac < PSOC_IDAC_SIGNED_MAX) {
            target_dac++;
        } else {
            target_dac--;
        }
    }
    delta_counts = cal_pi_geo_lp_response_counts(target_dac) -
                   cal_pi_geo_lp_response_counts(base_dac);
    delta_code = (int32)target_dac - (int32)base_dac;
    gain = abs_counts(cal_round_div_i64(
        (int64)delta_counts * (int64)CAL_ADC_SPAN_UV * 1000LL,
        (int64)delta_code * (int64)CAL_ADC_LEVELS *
        (int64)CAL_IDAC_UV_PER_LSB));
    if (gain < 200L) { gain = 200L; }
    if (gain > 850L) { gain = 850L; }
    return gain;
}
#endif

static int8 cal_pi_effort_delta_sign(int32 control_error, int8 direction, int32 gain_x1000)
{
    int8 sign;

    if (control_error == 0L || direction == 0 || gain_x1000 == 0L) {
        return 0;
    }

    sign = (control_error > 0L) ? 1 : -1;
    if (direction < 0) {
        sign = (int8)-sign;
    }
    if (gain_x1000 < 0L) {
        sign = (int8)-sign;
    }
    return sign;
}

static uint8 cal_pi_finalize_stage(uint8 ok, int16 final_dac, int32 final_measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 final_pass;

    final_dac = cal_stage_clamp_dac(stage, final_dac);
    stage->write(final_dac);
    result->final_dac = final_dac;
    result->final_measured = final_measured;
    result->ok = ok;
    final_pass = ((uint8)(g_cal_async.pass_index + 1u) >= (uint8)CAL_PI_PASS_COUNT) ? 1u : 0u;
    if (!ok && final_pass) {
        g_cal_async.ok = 0u;
    }

    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

    g_cal_async.stage_index = cal_siguiente_etapa(g_cal_async.stage_index + 1u);
    if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
        if (!final_pass) {
            g_cal_async.pass_index++;
            g_cal_async.stage_index = cal_siguiente_etapa(0u);
            g_cal_pi.state = CAL_PI_STAGE_BEGIN;
            return 0u;
        }
        cal_async_complete();
        return 1u;
    }
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
    return 0u;
}

/* Cierra la etapa con lo que el lazo ya tiene y agrega un unico refinamiento
 * de cuantizacion: probar el LSB que deberia reducir el error fisico; si no
 * mejora el error absoluto medido por el FIR, vuelve al DAC anterior. */
static uint8 cal_pi_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 control_sample;
    int32 error_counts;
    int8 step_sign;
    int16 dac_lo;
    int16 dac_hi;
    int16 trial_dac;

    if (!cfg->refine_enable || !ok || !cal_pi_measurement_valid(g_cal_pi.last_fir_output)) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    if (stage_gain_x1000 == 0L) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    step_sign = cal_pi_effort_delta_sign(error_counts, stage->direction, stage_gain_x1000);
    if (step_sign == 0) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

