simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    dac_lo = cal_stage_min_dac(stage);
    dac_hi = cal_stage_max_dac(stage);
    if (step_sign > 0) {
        if (g_cal_pi.dac_current >= dac_hi) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (int16)(g_cal_pi.dac_current + 1);
    } else {
        if (g_cal_pi.dac_current <= dac_lo) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (int16)(g_cal_pi.dac_current - 1);
    }

    g_cal_pi.refine_ok = ok;
    g_cal_pi.refine_base_dac = g_cal_pi.dac_current;
    g_cal_pi.refine_trial_dac = trial_dac;
    g_cal_pi.refine_base_measured = g_cal_pi.last_fir_output;
    g_cal_pi.refine_base_abs_error = cal_pi_abs_error_counts(stage, g_cal_pi.last_fir_output);
    /* El refinamiento mueve UN codigo, asi que aca la espera de planta no
     * corresponde: el salto que provoca es del orden del LSB del actuador y no
     * excita el polo lento de forma apreciable. Lo unico que hay que esperar es
     * la memoria del camino de medida, que es lo que dice la tabla. */
    g_cal_pi.settle_remaining = cal_pi_samples_to_iters(cfg->refine_settle_samples);
    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.dac_current = trial_dac;
    stage->write(trial_dac);
    g_cal_pi.state = CAL_PI_REFINE_SETTLE;
    return 0u;
}

static void cal_pi_stage_begin(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 deadband_counts;

    cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_counts = cal_pi_deadband_counts(g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_PI_GAIN32, stage_gain_x1000);
    cal_diag(PSOC_EVT_CAL_PI_DEADBAND,
             (deadband_counts > 255L) ? 255u : (uint8)deadband_counts);

    g_cal_pi.integral = 0L;
    g_cal_pi.samples_taken = 0u;
    g_cal_pi.stable_count = 0u;
    g_cal_pi.have_last_error = 0u;
    g_cal_pi.last_error_dac = 0L;
    g_cal_pi.last_error_bucket = 0L;
    g_cal_pi.last_dac_target = 0u;
    g_cal_pi.last_fir_output = 0L;
    g_cal_pi.empty_polls = 0UL;
    /* LA ESPERA DE PLANTA VALE PARA LAS DOS RUTAS DE LECTURA.
     *
     * Hasta el 2026-09-05 esta linea estaba partida en un #if y la rama del
     * lector directo -que es la que compila por defecto, y por lo tanto la que
     * corre en la placa- ponia simplemente 1. O sea que psoc_cal_plant_settle_
     * samples(), el parametro tau ajustable en caliente y todo el trabajo del
     * 2026-09-04 eran codigo muerto: la calibracion del nodo nunca esperaba a
     * que la cadena se asentara.
     *
     * El razonamiento que justificaba el 1 era que cada lectura directa ya
     * espera CAL_ADC_DIRECT_CONVERSION_MS, y es cierto: 30 ms alcanzan para que
     * se asiente el DECIMADOR DEL ADC. Pero lo que hay que esperar es otra cosa
     * y es cuatro ordenes de magnitud mas lenta: el polo de C1 contra R4, con
     * tau ~ 29,5 s. Son dos transitorios distintos que quedaron confundidos en
     * la misma constante.
     *
     * La espera sale de la variable de ejecucion y no de la tabla, para que la
     * automedicion de tau tenga efecto sin recompilar. */
    g_cal_pi.settle_remaining = cal_pi_samples_to_iters(
        (uint32)cfg->settle_samples + psoc_cal_plant_settle_samples());
    g_cal_pi.control_hold_remaining = 0u;
    g_cal_pi.refine_base_measured = 0L;
    g_cal_pi.refine_base_abs_error = 0L;
    g_cal_pi.refine_base_dac = 0u;
    g_cal_pi.refine_trial_dac = 0u;
    g_cal_pi.refine_ok = 0u;
    g_cal_pi.base_dac = cal_stage_current_dac(g_cal_async.stage_index);
    g_cal_pi.dac_current = g_cal_pi.base_dac;
    stage->write(g_cal_pi.dac_current);

    ADC_Stop();
    CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
    cal_diag(PSOC_EVT_CAL_AMUX_IN, stage->adc_channel);
#if CAL_AMUX_HAS_CAP_CHANNEL
    cal_diag(PSOC_EVT_CAL_AMUX_CAP, CAL_AMUX_CAP_CHANNEL);
#endif
    ADC_Start();

    stage->write(g_cal_pi.dac_current);

    /* Al cambiar de AMux, la linea de retardo contiene otra etapa. Borrarla
     * permite que el settle sea exactamente la longitud del FIR, no un margen
     * empirico de 512 muestras. */
    psoc_filter_reset_history();

    /* El PI no promedia/EMA en software: extrae el DC con el FIR de hardware
     * (Canal A del Filter, coeficientes de FIR_calibration.h cargados en
     * cal_pi_start) -- ADC -> Filter_STAGEA -> DMA_Filter_RAM, leido muestra
     * a muestra en cal_pi_run_service. */
#if CAL_PI_USE_DIRECT_ADC
    dma_route_select(0u);
#else
    dma_route_select(1u);
#endif
    psoc_filter_reset_history();
    psoc_adc_clear_isr_filtered_sample();
#ifdef CY_ISR_isr_DMA_Filter_RAM_H
    isr_DMA_Filter_RAM_ClearPending();
#endif
    ADC_StartConvert();

    g_cal_pi.state = (g_cal_pi.settle_remaining == 0u) ? CAL_PI_RUN : CAL_PI_SETTLE;
}

static uint8 cal_pi_settle_service(void)
{
    int32 sample;

    if (!cal_pi_take_control_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining == 0u) {
        g_cal_pi.integral = 0L;
        g_cal_pi.samples_taken = 0u;
        g_cal_pi.stable_count = 0u;
        g_cal_pi.have_last_error = 0u;
        g_cal_pi.last_error_dac = 0L;
        g_cal_pi.last_error_bucket = 0L;
        g_cal_pi.empty_polls = 0UL;
        g_cal_pi.state = CAL_PI_RUN;
    }

    return 0u;
}

static uint8 cal_pi_refine_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    int32 sample;
    int32 trial_abs_error;

    if (!cal_pi_take_control_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            stage->write(g_cal_pi.refine_base_dac);
            g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
            g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
            return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                         g_cal_pi.refine_base_dac,
                                         g_cal_pi.refine_base_measured);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining != 0u) {
        return 0u;
    }

    trial_abs_error = cal_pi_abs_error_counts(stage, sample);
    if (trial_abs_error < g_cal_pi.refine_base_abs_error &&
        cal_pi_measurement_valid(sample)) {
        g_cal_pi.dac_current = g_cal_pi.refine_trial_dac;
        return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                     g_cal_pi.refine_trial_dac,
                                     sample);
    }

    stage->write(g_cal_pi.refine_base_dac);
    g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
    g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
    return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                 g_cal_pi.refine_base_dac,
                                 g_cal_pi.refine_base_measured);
}

