simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    /* anti-windup tipo clamping y zona muerta: dentro de deadband no se
     * acumula error para no perseguir pasos imposibles del VDAC. */
    if (can_integrate && stage_gain_x1000 != 0L && control_error != 0L) {
        g_cal_pi.integral = cal_pi_clip_integral(g_cal_pi.integral + control_error);
    }

    /* Lock por M muestras: dentro de deadband cierra OK. Fuera de deadband,
     * mantener el mismo bucket no alcanza para cerrar mientras la integral
     * todavia puede acumular el siguiente LSB de DAC. Un cambio efectivo de
     * DAC reinicia el contador de estabilidad. */
    lock_n = (cfg->lock_samples == 0u || cfg->lock_samples > CAL_PI_LOCK_N_MAX)
        ? CAL_PI_LOCK_N_MAX : cfg->lock_samples;

    if (!g_cal_pi.have_last_error ||
        error_bucket != g_cal_pi.last_error_bucket ||
        dac_changed) {
        g_cal_pi.stable_count = 1u;
    } else if (g_cal_pi.stable_count < 65535u) {
        g_cal_pi.stable_count++;
    }
    g_cal_pi.have_last_error = 1u;
    g_cal_pi.last_error_dac = error_dac;
    g_cal_pi.last_error_bucket = error_bucket;
    g_cal_pi.last_dac_target = dac_target;

    if (sample_index == 1u || (sample_index % CAL_PI_TELEM_PERIOD) == 0u) {
        cal_diag_i16(PSOC_EVT_CAL_STAGE_DAC, (int32)dac_sample);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, g_cal_pi.last_fir_output);
        cal_diag_i32(PSOC_EVT_CAL_PI_ERROR32, error_dac);
        cal_diag_i32(PSOC_EVT_CAL_PI_BUCKET32, error_bucket);
        cal_diag(PSOC_EVT_CAL_PI_STABLE,
                 (g_cal_pi.stable_count > 255u) ? 255u : (uint8)g_cal_pi.stable_count);
    }

    g_cal_pi.dac_current = dac_target;
    stage->write(g_cal_pi.dac_current);
    if (dac_changed) {
#if CAL_PI_USE_DIRECT_ADC
        /* La siguiente lectura directa ya integra 30 ms de conversiones. */
        g_cal_pi.control_hold_remaining = 0u;
#else
        g_cal_pi.control_hold_remaining = cfg->settle_samples;
#endif
    }

    if (g_cal_pi.stable_count >= lock_n) {
        if (error_bucket == 0L && cal_pi_measurement_valid(g_cal_pi.last_fir_output)) {
            return cal_pi_finish_stage(1u);
        }
        if (stage_gain_x1000 == 0L) {
            return cal_pi_finish_stage(0u);
        }
    }

    /* El techo esta declarado en muestras porque es un tiempo -11,5 s para las
     * etapas cortas, 17,3 s para las lentas- y aca se lo pasa a iteraciones del
     * lazo, que con el lector directo duran 30 ms cada una. */
    if (g_cal_pi.samples_taken >= cal_pi_samples_to_iters(cfg->timeout_samples)) {
        return cal_pi_finish_stage((error_bucket == 0L &&
                                    cal_pi_measurement_valid(g_cal_pi.last_fir_output)) ? 1u : 0u);
    }

    return 0u;
}

static void cal_pi_start(void)
{
    /* Carga el FIR pensado para calibracion (suavizado, distinto del de
     * adquisicion) en el Filter de hardware -- se restaura el de
     * adquisicion en cal_async_complete() al cerrar la corrida. */
    (void)psoc_filter_load_fir_coefficients(g_fir_calibration_coeffs_q23, FILTER_FIR_NTAPS);
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
}

static uint8 cal_pi_service(void)
{
    switch (g_cal_pi.state) {
        case CAL_PI_STAGE_BEGIN:
            cal_pi_stage_begin();
            return 0u;
        case CAL_PI_SETTLE:
            return cal_pi_settle_service();
        case CAL_PI_RUN:
            return cal_pi_run_service();
        case CAL_PI_REFINE_SETTLE:
            return cal_pi_refine_service();
        default:
            return 0u;
    }
}

uint8 psoc_calibration_start_async(void)
{
    uint8 i;
    uint8 verify_ok;
    int16 seed_dac[PSOC_CAL_MAX_STAGES];

    if (g_cal_async.busy) {
        return 0u;
    }

#ifdef CY_ISR_isr_SyncIn_H
    isr_SyncIn_Disable();
#endif
    ADC_Stop();
    psoc_adc_select_capture_config();
    ADC_Stop();

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        seed_dac[i] = cal_stage_current_dac(i);
    }

    verify_ok = cal_verify_seeded_values();
    if (verify_ok) {
        g_cal_async.busy = 0u;
        g_cal_async.done = 1u;
        g_cal_async.ok = 1u;
        return 2u;
    }

    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    g_cal_async.busy = 1u;
    g_cal_async.done = 0u;
    g_cal_async.ok = 1u;
    g_cal_async.stage_index = cal_siguiente_etapa(0u);
    g_cal_async.pass_index = 0u;
    psoc_cal_timer_start(CAL_PROGRESS_PERIOD_MS, CAL_WATCHDOG_MS);
    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        g_psoc_cal_stages[i].write(seed_dac[i]);
        g_psoc_cal_results[i].final_dac = seed_dac[i];
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 0u;
    }
    cal_pi_start();   /* unico camino de calibracion, GEO y HAMMER por igual */
    return 1u;
}

uint8 psoc_calibration_async_busy(void)
{
    return g_cal_async.busy;
}

uint8 psoc_calibration_async_result_ok(void)
{
    return g_cal_async.ok;
}

uint8 psoc_calibration_service_async(void)
{
    if (!g_cal_async.busy) {
        return 0u;
    }

    if (psoc_cal_timer_take_watchdog_due()) {
        cal_async_abort_watchdog();
        return 1u;
    }
    if (psoc_cal_timer_take_progress_due()) {
        cal_diag(PSOC_EVT_CAL_PROGRESS, g_cal_async.stage_index);
    }

    return cal_pi_service();   /* unico camino de calibracion */
}
